Revit 2027 API
ParameterTypeId.LockedEndOffset Property
 "Positive Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LockedEndOffset { get; }
Public Shared ReadOnly Property LockedEndOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LockedEndOffset {
	ForgeTypeId^ get ();
}
static member LockedEndOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace